# Discounted Items #

#### The Goal is to help Genullz Traders, Inc. process and analyze their internal API data on customer sales. They want you to do 2 things for them. #### 

* 1. Convert their internal API results into a MySQL Database

* 2. Formally answer the following question using hypothesis testing: 

#### “Do discounted products sell in higher quantities than non-discounted products?“ ####

# ETL of JSON File

In [1]:
!pip install numpy
!pip install scipy
!pip install pymysql

import json
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats


import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

Requirement already satisfied: numpy in c:\users\admin\anaconda3\lib\site-packages (1.24.4)
Requirement already satisfied: scipy in c:\users\admin\anaconda3\lib\site-packages (1.9.1)
Requirement already satisfied: numpy<1.25.0,>=1.18.5 in c:\users\admin\anaconda3\lib\site-packages (from scipy) (1.24.4)
Requirement already satisfied: pymysql in c:\users\admin\anaconda3\lib\site-packages (1.1.0)

# Extract

In [2]:
## Loading json file
with open('raw_discounted_Items.json') as f:
    results = json.load(f)
results.keys()

dict_keys(['meta', 'data'])

In [3]:
## explore each key 
type(results['meta'])

str

In [4]:
## display meta
results['meta']

'Discounted items'

In [5]:
## display data
type(results['data'])

dict

In [6]:
## preview just the keys
results['data'].keys()

dict_keys(['categories', 'orders', 'products', 'orderdetails'])

In [7]:
## checking single entry of categories
results['data']['categories'][0]

{'CategoryID': 1,
 'CategoryName': 'Beverages',
 'Description': 'Soft drinks, coffees, teas, beers, and ales'}

In [8]:
## making categories a dataframe
categories = pd.DataFrame(results['data']['categories'])
categories

,CategoryID,CategoryName,Description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"
5,6,Meat/Poultry,Prepared meats
6,7,Produce,Dried fruit and bean curd
7,8,Seafood,Seaweed and fish

In [9]:
## making orders a dataframe
orders = pd.DataFrame(results['data']['orders'])
orders

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry,OrderSubtotal,OrderTotal
0,10248,VINET,5,1994-08-04,1994-09-01,1994-08-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France,440.0000,472.3800
1,10249,TOMSP,6,1994-08-05,1994-09-16,1994-08-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany,1863.4000,1875.0100
2,10250,HANAR,4,1994-08-08,1994-09-05,1994-08-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil,1552.6000,1618.4300
3,10251,VICTE,3,1994-08-08,1994-09-05,1994-08-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France,654.0600,695.4000
4,10252,SUPRD,4,1994-08-09,1994-09-06,1994-08-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium,3597.9000,3649.2000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
825,11073,PERIC,2,1996-06-04,1996-07-02,None,2,24.95,Pericles Comidas clásicas,Calle Dr. Jorge Cash 321,México D.F.,None,05033,Mexico,300.0000,324.9500
826,11074,SIMOB,7,1996-06-05,1996-07-03,None,2,18.44,Simons bistro,Vinbæltet 34,København,None,1734,Denmark,232.0850,250.5250
827,11075,RICSU,8,1996-06-05,1996-07-03,None,2,6.19,Richter Supermarkt,Starenweg 5,Genève,None,1204,Switzerland,498.1000,504.2900
828,11076,BONAP,4,1996-06-05,1996-07-03,None,2,38.28,Bon app',"12, rue des Bouchers",Marseille,None,13008,France,792.7500,831.0300
829,11077,RATTC,1,1996-06-05,1996-07-03,None,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA,1255.7205,1264.2505

In [10]:
## making products a dataframe
products = pd.DataFrame(results['data']['products'])
products

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...
72,73,Röd Kaviar,17,8,24 - 150 g jars,15.00,101,0,5,0
73,74,Longlife Tofu,4,7,5 kg pkg.,10.00,4,20,5,0
74,75,Rhönbräu Klosterbier,12,1,24 - 0.5 l bottles,7.75,125,0,25,0
75,76,Lakkalikööri,23,1,500 ml,18.00,57,0,20,0
76,77,Original Frankfurter grüne Soße,12,2,12 boxes,13.00,32,0,15,0

In [11]:
## making orderdetails a dataframe
orderdetails = pd.DataFrame(results['data']['orderdetails'])
orderdetails

     Order-ProductID UnitPrice  Quantity Discount SalePrice   Subtotal
0           10248-11    $14.00        12     0.0%    $14.00    $168.00
1           10248-42     $9.80        10     0.0%     $9.80     $98.00
2           10248-72    $34.80         5     0.0%    $34.80    $174.00
3           10249-14    $18.60         9     0.0%    $18.60    $167.40
4           10249-51    $42.40        40     0.0%    $42.40  $1,696.00
...              ...       ...       ...      ...       ...        ...
2150        11077-64    $33.25         2     3.0%    $32.25     $64.50
2151        11077-66    $17.00         1     0.0%    $17.00     $17.00
2152        11077-73    $15.00         2     1.0%    $14.85     $29.70
2153        11077-75     $7.75         4     0.0%     $7.75     $31.00
2154        11077-77    $13.00         2     0.0%    $13.00     $26.00

[2155 rows x 6 columns]

In [12]:
orderdetails.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Order-ProductID  2145 non-null   object
 1   UnitPrice        2123 non-null   object
 2   Quantity         2155 non-null   int64
 3   Discount         2155 non-null   object
 4   SalePrice        2123 non-null   object
 5   Subtotal         2123 non-null   object
dtypes: int64(1), object(5)
memory usage: 101.1+ KB

# Transform

Separate order and product ID into two separate columns

In [13]:
orderdetails.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Order-ProductID  2145 non-null   object
 1   UnitPrice        2123 non-null   object
 2   Quantity         2155 non-null   int64
 3   Discount         2155 non-null   object
 4   SalePrice        2123 non-null   object
 5   Subtotal         2123 non-null   object
dtypes: int64(1), object(5)
memory usage: 101.1+ KB

In [14]:
## Separate order and product ID into two separate columns
orderdetails['Order-ProductID'].str.split('-',expand=True)

          0   1
0     10248  11
1     10248  42
2     10248  72
3     10249  14
4     10249  51
...     ...  ..
2150  11077  64
2151  11077  66
2152  11077  73
2153  11077  75
2154  11077  77

[2155 rows x 2 columns]

In [15]:
orderdetails.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Order-ProductID  2145 non-null   object
 1   UnitPrice        2123 non-null   object
 2   Quantity         2155 non-null   int64
 3   Discount         2155 non-null   object
 4   SalePrice        2123 non-null   object
 5   Subtotal         2123 non-null   object
dtypes: int64(1), object(5)
memory usage: 101.1+ KB

In [16]:
## save the 2 new columns into the dataframe
orderdetails[['Order','ProductID']] = orderdetails['Order-ProductID'].str.split('-',expand=True)
orderdetails.head()

,Order-ProductID,UnitPrice,Quantity,Discount,SalePrice,Subtotal,Order,ProductID
0,10248-11,$14.00,12,0.0%,$14.00,$168.00,10248,11
1,10248-42,$9.80,10,0.0%,$9.80,$98.00,10248,42
2,10248-72,$34.80,5,0.0%,$34.80,$174.00,10248,72
3,10249-14,$18.60,9,0.0%,$18.60,$167.40,10249,14
4,10249-51,$42.40,40,0.0%,$42.40,"$1,696.00",10249,51

In [17]:
## drop the original column 
orderdetails = orderdetails.drop(columns=['Order-ProductID'])
orderdetails.head()

  UnitPrice  Quantity Discount SalePrice   Subtotal  Order ProductID
0    $14.00        12     0.0%    $14.00    $168.00  10248        11
1     $9.80        10     0.0%     $9.80     $98.00  10248        42
2    $34.80         5     0.0%    $34.80    $174.00  10248        72
3    $18.60         9     0.0%    $18.60    $167.40  10249        14
4    $42.40        40     0.0%    $42.40  $1,696.00  10249        51

Clean financial columns and convert to numeric:

Remove “$”, “%” and “,” for UnitPrice, Discount, SalePrice and Subtotal 

and then convert to numeric.

In [18]:
## fixing UnitPrice, SalePrice, Subtotal amount column
orderdetails['UnitPrice'] = orderdetails['UnitPrice'].str.replace('$','')
orderdetails['UnitPrice'] = pd.to_numeric(orderdetails['UnitPrice'])
orderdetails

C:\Users\Admin\AppData\Local\Temp\ipykernel_12056\3602181770.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orderdetails['UnitPrice'] = orderdetails['UnitPrice'].str.replace('$','')

      UnitPrice  Quantity Discount SalePrice   Subtotal  Order ProductID
0         14.00        12     0.0%    $14.00    $168.00  10248        11
1          9.80        10     0.0%     $9.80     $98.00  10248        42
2         34.80         5     0.0%    $34.80    $174.00  10248        72
3         18.60         9     0.0%    $18.60    $167.40  10249        14
4         42.40        40     0.0%    $42.40  $1,696.00  10249        51
...         ...       ...      ...       ...        ...    ...       ...
2150      33.25         2     3.0%    $32.25     $64.50  11077        64
2151      17.00         1     0.0%    $17.00     $17.00  11077        66
2152      15.00         2     1.0%    $14.85     $29.70  11077        73
2153       7.75         4     0.0%     $7.75     $31.00  11077        75
2154      13.00         2     0.0%    $13.00     $26.00  11077        77

[2155 rows x 7 columns]

In [19]:
## fixing SalePrice amount column
orderdetails['SalePrice'] = orderdetails['SalePrice'].str.replace('$','')
orderdetails['SalePrice'] = pd.to_numeric(orderdetails['SalePrice'])
orderdetails

C:\Users\Admin\AppData\Local\Temp\ipykernel_12056\2841673544.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orderdetails['SalePrice'] = orderdetails['SalePrice'].str.replace('$','')

      UnitPrice  Quantity Discount  SalePrice   Subtotal  Order ProductID
0         14.00        12     0.0%      14.00    $168.00  10248        11
1          9.80        10     0.0%       9.80     $98.00  10248        42
2         34.80         5     0.0%      34.80    $174.00  10248        72
3         18.60         9     0.0%      18.60    $167.40  10249        14
4         42.40        40     0.0%      42.40  $1,696.00  10249        51
...         ...       ...      ...        ...        ...    ...       ...
2150      33.25         2     3.0%      32.25     $64.50  11077        64
2151      17.00         1     0.0%      17.00     $17.00  11077        66
2152      15.00         2     1.0%      14.85     $29.70  11077        73
2153       7.75         4     0.0%       7.75     $31.00  11077        75
2154      13.00         2     0.0%      13.00     $26.00  11077        77

[2155 rows x 7 columns]

In [20]:
## fixing Subtotal amount column
orderdetails['Subtotal'] = orderdetails['Subtotal'].str.replace(',','')
orderdetails

      UnitPrice  Quantity Discount  SalePrice  Subtotal  Order ProductID
0         14.00        12     0.0%      14.00   $168.00  10248        11
1          9.80        10     0.0%       9.80    $98.00  10248        42
2         34.80         5     0.0%      34.80   $174.00  10248        72
3         18.60         9     0.0%      18.60   $167.40  10249        14
4         42.40        40     0.0%      42.40  $1696.00  10249        51
...         ...       ...      ...        ...       ...    ...       ...
2150      33.25         2     3.0%      32.25    $64.50  11077        64
2151      17.00         1     0.0%      17.00    $17.00  11077        66
2152      15.00         2     1.0%      14.85    $29.70  11077        73
2153       7.75         4     0.0%       7.75    $31.00  11077        75
2154      13.00         2     0.0%      13.00    $26.00  11077        77

[2155 rows x 7 columns]

In [21]:
## fixing Subtotal amount column
orderdetails['Subtotal'] = orderdetails['Subtotal'].str.replace('$','')
orderdetails['Subtotal'] = pd.to_numeric(orderdetails['Subtotal'])
orderdetails

C:\Users\Admin\AppData\Local\Temp\ipykernel_12056\3777541873.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orderdetails['Subtotal'] = orderdetails['Subtotal'].str.replace('$','')

      UnitPrice  Quantity Discount  SalePrice  Subtotal  Order ProductID
0         14.00        12     0.0%      14.00     168.0  10248        11
1          9.80        10     0.0%       9.80      98.0  10248        42
2         34.80         5     0.0%      34.80     174.0  10248        72
3         18.60         9     0.0%      18.60     167.4  10249        14
4         42.40        40     0.0%      42.40    1696.0  10249        51
...         ...       ...      ...        ...       ...    ...       ...
2150      33.25         2     3.0%      32.25      64.5  11077        64
2151      17.00         1     0.0%      17.00      17.0  11077        66
2152      15.00         2     1.0%      14.85      29.7  11077        73
2153       7.75         4     0.0%       7.75      31.0  11077        75
2154      13.00         2     0.0%      13.00      26.0  11077        77

[2155 rows x 7 columns]

In [22]:
## fixing Discount percentage column
orderdetails['Discount'] = orderdetails['Discount'].str.replace('%','')
orderdetails['Discount'] = pd.to_numeric(orderdetails['Discount'])
orderdetails

      UnitPrice  Quantity  Discount  SalePrice  Subtotal  Order ProductID
0         14.00        12       0.0      14.00     168.0  10248        11
1          9.80        10       0.0       9.80      98.0  10248        42
2         34.80         5       0.0      34.80     174.0  10248        72
3         18.60         9       0.0      18.60     167.4  10249        14
4         42.40        40       0.0      42.40    1696.0  10249        51
...         ...       ...       ...        ...       ...    ...       ...
2150      33.25         2       3.0      32.25      64.5  11077        64
2151      17.00         1       0.0      17.00      17.0  11077        66
2152      15.00         2       1.0      14.85      29.7  11077        73
2153       7.75         4       0.0       7.75      31.0  11077        75
2154      13.00         2       0.0      13.00      26.0  11077        77

[2155 rows x 7 columns]

### Drop any rows with null values.

In [23]:
## check for missing values
orderdetails.isna().sum()

UnitPrice    32
Quantity      0
Discount      0
SalePrice    32
Subtotal     32
Order        10
ProductID    10
dtype: int64

In [24]:
## Drop missing Values
orderdetails.dropna(subset=['UnitPrice'], inplace=True) 
orderdetails.isna().sum()

UnitPrice     0
Quantity      0
Discount      0
SalePrice     0
Subtotal      0
Order        10
ProductID    10
dtype: int64

In [25]:
## Drop missing Values
orderdetails.dropna(subset=['SalePrice'], inplace=True) 
orderdetails.isna().sum()

UnitPrice     0
Quantity      0
Discount      0
SalePrice     0
Subtotal      0
Order        10
ProductID    10
dtype: int64

In [26]:
## Drop missing Values
orderdetails.dropna(subset=['Subtotal'], inplace=True)
orderdetails.dropna(subset=['Order'], inplace=True)
orderdetails.dropna(subset=['ProductID'], inplace=True)
orderdetails.isna().sum()

UnitPrice    0
Quantity     0
Discount     0
SalePrice    0
Subtotal     0
Order        0
ProductID    0
dtype: int64

In [27]:
orderdetails.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2113 entries, 0 to 2154
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   UnitPrice  2113 non-null   float64
 1   Quantity   2113 non-null   int64
 2   Discount   2113 non-null   float64
 3   SalePrice  2113 non-null   float64
 4   Subtotal   2113 non-null   float64
 5   Order      2113 non-null   object
 6   ProductID  2113 non-null   object
dtypes: float64(4), int64(1), object(2)
memory usage: 132.1+ KB

In [28]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   OrderID         830 non-null    int64
 1   CustomerID      830 non-null    object
 2   EmployeeID      830 non-null    int64
 3   OrderDate       830 non-null    object
 4   RequiredDate    830 non-null    object
 5   ShippedDate     809 non-null    object
 6   ShipVia         830 non-null    int64
 7   Freight         830 non-null    float64
 8   ShipName        830 non-null    object
 9   ShipAddress     830 non-null    object
 10  ShipCity        830 non-null    object
 11  ShipRegion      323 non-null    object
 12  ShipPostalCode  811 non-null    object
 13  ShipCountry     830 non-null    object
 14  OrderSubtotal   830 non-null    float64
 15  OrderTotal      830 non-null    float64
dtypes: float64(3), int64(3), object(10)
memory usage: 103.9+ KB

In [29]:
categories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CategoryID    8 non-null      int64
 1   CategoryName  8 non-null      object
 2   Description   8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [30]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ProductID        77 non-null     int64
 1   ProductName      77 non-null     object
 2   SupplierID       77 non-null     int64
 3   CategoryID       77 non-null     int64
 4   QuantityPerUnit  77 non-null     object
 5   UnitPrice        77 non-null     float64
 6   UnitsInStock     77 non-null     int64
 7   UnitsOnOrder     77 non-null     int64
 8   ReorderLevel     77 non-null     int64
 9   Discontinued     77 non-null     int64
dtypes: float64(1), int64(7), object(2)
memory usage: 6.1+ KB

# Load

In [36]:
## creating connection to database with sqlalchemy
connection= f'mysql+pymysql://root:root@127.0.0.1:3306/discounted-items'
engine = create_engine(connection)

In [37]:
## Check if database exists, if not, create it

if database_exists(connection) == False: 
   create_database(connection)
else: 
   print('The database already exists.')

The database already exists.

In [40]:
## saving dataframes to database
categories.to_sql('categories', engine, index=False, if_exists = 'replace')
orders.to_sql('orders', engine, index=False, if_exists = 'replace')
products.to_sql('products', engine, index=False, if_exists = 'replace')
orderdetails.to_sql('orderdetails', engine, index=False, if_exists = 'replace')

2113

In [41]:
## checking if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_discounted-items
0                 categories
1               orderdetails
2                     orders
3                   products

# Hypothesis Test

### Using our data from above to test the stakeholder’s hypothesis about the effect of discounts.

### State the Hypothesis & Null Hypothesis

- $H_0$ (Null Hypothesis): There is no difference of sales in quantity between discounted products and non-discounted products.
- $H_A$ (Alternative Hypothesis): There is a significant difference of sales in quantity between discounted products and non-discounted products.

- Based upon the choosing the Right Hypothesis:
- **The appropriate test to perform would be:**
        - Since we are measuring a numeric quantity (sales in quantity)
        - and we are comparing 2 groups/samples. 
        - We therefore want to perform a 2-sample t-test, A.K.A. an independent t-test.
    
- **According the the work flow, the 2-sample T-Test has the following assumptions:** 
    - No significant outliers
    - Normality
    - Equal Variance

### The next step is to get the data for each group in separate variables. All of the approaches below will lead to the same result: a `discounted products` and `non-discounted products` variable.

### 1st Approach : Using the MySQL Database to Get DF to Filter

In [ ]:
q = """SELECT 
    o.Discount, o.Quantity, o.SalePrice
FROM
    orderdetails AS o
        JOIN
    products AS p ON p.ProductID = o.ProductID;"""
orderdetails = pd.read_sql(q,engine)
orderdetails

In [ ]:
## Create a column that defines the 2 groups, non-Discount products or not.
orderdetails['non_discounted_products'] = orderdetails['Discount'] == 0.0
orderdetails

In [ ]:
## Separate the column of interest based on the groups
discounted = orderdetails.loc[ orderdetails['non_discounted_products']==False, ['SalePrice', 'Quantity', 'non_discounted_products']]
non_discounted = orderdetails.loc[ orderdetails['non_discounted_products']==True, ['SalePrice', 'Quantity', 'non_discounted_products']]
print(f"There are {len(discounted)} discounted SalePrice in quantity." )
print(f"There are {len(non_discounted)} non_discounted SalePrice in quantity." )

2nd Approach

In [ ]:
## importing text function to use on query with a "%" in it
from sqlalchemy import text

In [ ]:
# for non-discounted products sales in quantity
q= '''SELECT 
    o.Quantity, o.SalePrice, o.Discount = 0.0 as "non_discounted_products"
FROM
    orderdetails AS o
        JOIN
    products AS p ON p.ProductID = o.ProductID
WHERE
    o.Discount = 0.0;'''
non_discounted = pd.read_sql(text(q),engine)
non_discounted

In [ ]:
# for discounted products sales in quantity
q= '''SELECT 
    o.Quantity, o.SalePrice, o.Discount = 0.0 as "non_discounted_products"
FROM
    orderdetails AS o
        JOIN
    products AS p ON p.ProductID = o.ProductID
WHERE
    o.Discount >= 1.0;'''
discounted = pd.read_sql(text(q),engine)
discounted

In [ ]:
print(f"There are {len(non_discounted)} non_discounted SalePrice in quantity." )
print(f"There are {len(discounted)} discounted SalePrice in quantity." )

## Visualize Group Means

In [ ]:
## concatenate the two dataframes for visualziation.
plot_orderdetails = pd.concat([discounted, non_discounted], axis=0)
plot_orderdetails

In [ ]:
## visualizing means
ax = sns.barplot(data=plot_orderdetails, x='non_discounted_products', y='SalePrice', ci=68)

In [ ]:
non_discounted_group = non_discounted['SalePrice']
discounted_group = discounted['SalePrice']
display(non_discounted_group.head(), discounted_group.head())

## Checking Assumptions of 2-Sample T-test

Checking for Outliers

In [ ]:
## Checking for abs vlaue of z-scores that are > 3
is_outlier_non_discounted = np.abs(stats.zscore(non_discounted_group)) > 3
print(f"There are {is_outlier_non_discounted.sum()} outliers in the non_discounted group out of {len(non_discounted_group)})")

In [ ]:
non_discounted.loc[~is_outlier_non_discounted]

In [ ]:
## removing outliers from non_discounted_group
non_discounted_group = non_discounted_group.loc[~is_outlier_non_discounted]
non_discounted_group

In [ ]:
## Checking for abs vlaue of z-scores that are > 3
is_outlier_discounted = np.abs(stats.zscore(discounted_group)) > 3
print(f"There are {is_outlier_discounted.sum()} outliers in the discounted group of out of {len(discounted_group)}.")

In [ ]:
## removing outliers from discounted_group
discounted_group = discounted_group.loc[~is_outlier_discounted]
discounted_group

### Checking for Normality

since both groups have n > 15, we can safely ignore the assumption of normality.

### Checking for Equal Variance

In [ ]:
result = stats.levene(discounted_group, non_discounted_group)
print(result)
print(result.pvalue<.05)

- According to the documentation for stats.levene, the null hypothesis for the test is that both groups have equal variance. Since our p-value is less than .05 we reject that null hypothesis and conclude that our groups do NOT have equal variance. 

- Since we did NOT meet the assumption of equal variance, we will run our stats.ttest_ind using equal_var=False. This will run a Welch's T-Test, which is designed to account for unequal variance.

### Statistical Test

In [ ]:
result = stats.ttest_ind(discounted_group, non_discounted_group, equal_var=False)
print(result)
result.pvalue<.05

### Conclusion

- Our Welch's T-Test return a p-value < .05 (it was actually p <.0001!) we reject the null hypothesis and support the alternative hypothesis that there is a significant difference in discounted salePrice in quantity

In [ ]:
# In order to know if they are funded significantly MORE or LESS, we look at the actual means of our final groups.

print(f"The average discounted products sales in quantity  {discounted_group.mean():.2f}")
print(f"The average non_discounted products sales in quantity   {non_discounted_group.mean():.2f}")

Non_Discounted products has a higher Sale Price in quantity than that of the discounted products

Include a visualization showing the comparison you are testing.

In [ ]:
## concatenate the two dataframes for visualziation.
plot_orderdetails = pd.concat([discounted.loc[~is_outlier_discounted], 
                     non_discounted.loc[~is_outlier_non_discounted]], axis=0)
plot_orderdetails

In [ ]:
sns.barplot(data=plot_orderdetails, x='non_discounted_products',y='SalePrice')